3B/ECE358/src/06-Wireless.org
#+title: Wireless
#+author: Arnav Gupta
#+LATEX_HEADER: \usepackage{parskip,darkmode}
#+LATEX_HEADER: \enabledarkmode
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="src/latex.css" />

* Wireless Networks
Many more wireless phone subscribers than wired, and same for devices.

Challenges arise from wireless (communication over wireless link) and mobility (handling mobile user
who changes point of attachment to network).
Wireless \ne mobile.

*Base station* is typically connected to wired network and relays packets between wired network and
wireless hosts in its area.

*Wireless link* connects mobiles to base station and can be used as a backbone link. Multiple access
protocol coordinates link access, and can have various data rates and transmission distance.

*Infrastructure mode* is how base station connects mobiles into wired network.

With *ad hoc mode*, no base stations and so nodes can only transmit to other nodes within link
coverage. With this, nodes organize themselves into a network (route among themselves).

*Wireless network taxonomy*
- _infrastructure, single hop_: host connects to base station which connects to larger internet
- _infrastructure, multiple hops_: host may have to relay through several wireless nodes to connect
  to larger Internet: /mesh net/
- _no infrastructure, single hop_: no base station, no connection to larger internet (Bluetooth,
  ad hoc nets)
- _no infrastructure, multiple hops_: no base station, no connection to larger internet, may have to
  replay to reach a given wireless node

Long waves mean big antennas and small bandwidth.
Best bands are lower ones, since better propagation characteristics and larger antennas.
Issue is, more bandwidth on higher frequencies than lower ones, so lower ones are oversubscribed.

Spectrum not always used well and re-allocation often necessary.
Spectrum is a scarce resource and hence is heavily reused.
This can create *interference*.

Interference management and spectrum reuse are critical problems in wireless.

2 types of bands:
- _licensed_: used by cellular networks
- _unlicensed_: used by WiFi (and recently cellular)

Industrial, Scientific, Medical (ISM) wireless bands and is region of EM spectrum available for use
without license:
- used for wireless LANs and PANs
- four separate bands

Key words are *rate*, *range*, and *power consumption*.

Lower frequency has longer range.

*Half-duplex*: a node cannot and receive at the same time

*Decreased signal strength*: radio signal attenuates as it propagates through matter (path loss), and
some cannot cross walls at all

*Interference from other sources*: ISM bands shared by other devices and so devices can interfere with
interference occurring in licensed bands due to reuse

*Multipath propagation*: radio signals reflects off objects ground, arriving at destination at slightly
different times

All these make communication across wireless link difficult, but characteristics depend on the band and
are time-varying.

*Signal-to-Noise Ratio (SNR)*: larger means easier to extract signal from noise

Given physical layer, increasing power means increasing SNR and therefore decreasing BER.

Given SNR, choosing modulation and coding scheme that meets BER requirement means giving highest
throughput.

SNR may change with mobility, by dynamically adapting physical layer (modulation technique and rate).

By increasing power, interference increases as well.

With multiple wireless senders and receivers, there are additional problems:
- _hidden terminal problem_: two nodes can talk to some intermediate node but cannot hear each other
- _signal attenuation_: two nodes have their signal attenuated by some intermediate node

Cellular has:
- wide area coverage, proprietary networks, and more coordination between base stations
- licensed (expensive) spectrum
- high mobility

Wi-Fi has:
- local area coverage, last link for Internet, and little coordination between access points
- unlicensed (free) spectrum (2.4 GHz and 5.3 GHz)
- low/no mobility

In _IEEE standards_, Ethernet is 802.3, Wi-Fi is 802.11, and Wireless PAN (Bluetooth) is 802.15.

