3B/ECE358/06-Wireless.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-05 Thu 15:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Wireless</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/latex.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Wireless</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7d2e931">1. Wireless Networks</a>
<ul>
<li><a href="#org28f0661">1.1. 802.11</a>
<ul>
<li><a href="#org0ca7501">1.1.1. Architecture</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org7d2e931" class="outline-2">
<h2 id="org7d2e931"><span class="section-number-2">1.</span> Wireless Networks</h2>
<div class="outline-text-2" id="text-1">
<p>
Many more wireless phone subscribers than wired, and same for devices.
</p>

<p>
Challenges arise from wireless (communication over wireless link) and mobility (handling mobile user
who changes point of attachment to network).
Wireless &ne; mobile.
</p>

<p>
<b>Base station</b> is typically connected to wired network and relays packets between wired network and
wireless hosts in its area.
</p>

<p>
<b>Wireless link</b> connects mobiles to base station and can be used as a backbone link. Multiple access
protocol coordinates link access, and can have various data rates and transmission distance.
</p>

<p>
<b>Infrastructure mode</b> is how base station connects mobiles into wired network.
</p>

<p>
With <b>ad hoc mode</b>, no base stations and so nodes can only transmit to other nodes within link
coverage. With this, nodes organize themselves into a network (route among themselves).
</p>

<p>
<b>Wireless network taxonomy</b>
</p>
<ul class="org-ul">
<li><span class="underline">infrastructure, single hop</span>: host connects to base station which connects to larger internet</li>
<li><span class="underline">infrastructure, multiple hops</span>: host may have to relay through several wireless nodes to connect
to larger Internet: <i>mesh net</i></li>
<li><span class="underline">no infrastructure, single hop</span>: no base station, no connection to larger internet (Bluetooth,
ad hoc nets)</li>
<li><span class="underline">no infrastructure, multiple hops</span>: no base station, no connection to larger internet, may have to
replay to reach a given wireless node</li>
</ul>

<p>
Long waves mean big antennas and small bandwidth.
Best bands are lower ones, since better propagation characteristics and larger antennas.
Issue is, more bandwidth on higher frequencies than lower ones, so lower ones are oversubscribed.
</p>

<p>
Spectrum not always used well and re-allocation often necessary.
Spectrum is a scarce resource and hence is heavily reused.
This can create <b>interference</b>.
</p>

<p>
Interference management and spectrum reuse are critical problems in wireless.
</p>

<p>
2 types of bands:
</p>
<ul class="org-ul">
<li><span class="underline">licensed</span>: used by cellular networks</li>
<li><span class="underline">unlicensed</span>: used by WiFi (and recently cellular)</li>
</ul>

<p>
Industrial, Scientific, Medical (ISM) wireless bands and is region of EM spectrum available for use
without license:
</p>
<ul class="org-ul">
<li>used for wireless LANs and PANs</li>
<li>four separate bands</li>
</ul>

<p>
Key words are <b>rate</b>, <b>range</b>, and <b>power consumption</b>.
</p>

<p>
Lower frequency has longer range.
</p>

<p>
<b>Half-duplex</b>: a node cannot and receive at the same time
</p>

<p>
<b>Decreased signal strength</b>: radio signal attenuates as it propagates through matter (path loss), and
some cannot cross walls at all
</p>

<p>
<b>Interference from other sources</b>: ISM bands shared by other devices and so devices can interfere with
interference occurring in licensed bands due to reuse
</p>

<p>
<b>Multipath propagation</b>: radio signals reflects off objects ground, arriving at destination at slightly
different times
</p>

<p>
All these make communication across wireless link difficult, but characteristics depend on the band and
are time-varying.
</p>

<p>
<b>Signal-to-Noise Ratio (SNR)</b>: larger means easier to extract signal from noise
</p>

<p>
Given physical layer, increasing power means increasing SNR and therefore decreasing BER.
</p>

<p>
Given SNR, choosing modulation and coding scheme that meets BER requirement means giving highest
throughput.
</p>

<p>
SNR may change with mobility, by dynamically adapting physical layer (modulation technique and rate).
</p>

<p>
By increasing power, interference increases as well.
</p>

<p>
With multiple wireless senders and receivers, there are additional problems:
</p>
<ul class="org-ul">
<li><span class="underline">hidden terminal problem</span>: two nodes can talk to some intermediate node but cannot hear each other</li>
<li><span class="underline">signal attenuation</span>: two nodes have their signal attenuated by some intermediate node</li>
</ul>

<p>
Cellular has:
</p>
<ul class="org-ul">
<li>wide area coverage, proprietary networks, and more coordination between base stations</li>
<li>licensed (expensive) spectrum</li>
<li>high mobility</li>
</ul>

<p>
Wi-Fi has:
</p>
<ul class="org-ul">
<li>local area coverage, last link for Internet, and little coordination between access points</li>
<li>unlicensed (free) spectrum (2.4 GHz and 5.3 GHz)</li>
<li>low/no mobility</li>
</ul>

<p>
In <span class="underline">IEEE standards</span>, Ethernet is 802.3, Wi-Fi is 802.11, and Wireless PAN (Bluetooth) is 802.15.
</p>
</div>
