3B/ECE358/06-Wireless.tex
% Created 2024-12-05 Thu 15:58
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{parskip,darkmode}
\enabledarkmode
\author{Arnav Gupta}
\date{\today}
\title{Wireless}
\hypersetup{
 pdfauthor={Arnav Gupta},
 pdftitle={Wireless},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Wireless Networks}
\label{sec:org6b5e385}
Many more wireless phone subscribers than wired, and same for devices.

Challenges arise from wireless (communication over wireless link) and mobility (handling mobile user
who changes point of attachment to network).
Wireless \(\ne\) mobile.

\textbf{Base station} is typically connected to wired network and relays packets between wired network and
wireless hosts in its area.

\textbf{Wireless link} connects mobiles to base station and can be used as a backbone link. Multiple access
protocol coordinates link access, and can have various data rates and transmission distance.

\textbf{Infrastructure mode} is how base station connects mobiles into wired network.

With \textbf{ad hoc mode}, no base stations and so nodes can only transmit to other nodes within link
coverage. With this, nodes organize themselves into a network (route among themselves).

\textbf{Wireless network taxonomy}
\begin{itemize}
\item \uline{infrastructure, single hop}: host connects to base station which connects to larger internet
\item \uline{infrastructure, multiple hops}: host may have to relay through several wireless nodes to connect
to larger Internet: \emph{mesh net}
\item \uline{no infrastructure, single hop}: no base station, no connection to larger internet (Bluetooth,
ad hoc nets)
\item \uline{no infrastructure, multiple hops}: no base station, no connection to larger internet, may have to
replay to reach a given wireless node
\end{itemize}

Long waves mean big antennas and small bandwidth.
Best bands are lower ones, since better propagation characteristics and larger antennas.
Issue is, more bandwidth on higher frequencies than lower ones, so lower ones are oversubscribed.

Spectrum not always used well and re-allocation often necessary.
Spectrum is a scarce resource and hence is heavily reused.
This can create \textbf{interference}.

Interference management and spectrum reuse are critical problems in wireless.

2 types of bands:
\begin{itemize}
\item \uline{licensed}: used by cellular networks
\item \uline{unlicensed}: used by WiFi (and recently cellular)
\end{itemize}

Industrial, Scientific, Medical (ISM) wireless bands and is region of EM spectrum available for use
without license:
\begin{itemize}
\item used for wireless LANs and PANs
\item four separate bands
\end{itemize}

Key words are \textbf{rate}, \textbf{range}, and \textbf{power consumption}.

Lower frequency has longer range.

\textbf{Half-duplex}: a node cannot and receive at the same time

\textbf{Decreased signal strength}: radio signal attenuates as it propagates through matter (path loss), and
some cannot cross walls at all

\textbf{Interference from other sources}: ISM bands shared by other devices and so devices can interfere with
interference occurring in licensed bands due to reuse

\textbf{Multipath propagation}: radio signals reflects off objects ground, arriving at destination at slightly
different times

All these make communication across wireless link difficult, but characteristics depend on the band and
are time-varying.

\textbf{Signal-to-Noise Ratio (SNR)}: larger means easier to extract signal from noise

Given physical layer, increasing power means increasing SNR and therefore decreasing BER.

Given SNR, choosing modulation and coding scheme that meets BER requirement means giving highest
throughput.

SNR may change with mobility, by dynamically adapting physical layer (modulation technique and rate).

By increasing power, interference increases as well.

With multiple wireless senders and receivers, there are additional problems:
\begin{itemize}
\item \uline{hidden terminal problem}: two nodes can talk to some intermediate node but cannot hear each other
\item \uline{signal attenuation}: two nodes have their signal attenuated by some intermediate node
\end{itemize}

Cellular has:
\begin{itemize}
\item wide area coverage, proprietary networks, and more coordination between base stations
\item licensed (expensive) spectrum
\item high mobility
\end{itemize}

Wi-Fi has:
\begin{itemize}
\item local area coverage, last link for Internet, and little coordination between access points
\item unlicensed (free) spectrum (2.4 GHz and 5.3 GHz)
\item low/no mobility
\end{itemize}

In \uline{IEEE standards}, Ethernet is 802.3, Wi-Fi is 802.11, and Wireless PAN (Bluetooth) is 802.15.
