3B/ECE358/src/06-Wireless.org
** 802.11

802.11 Wireless LAN details:
- _802.11b_: 1999, 11 Mbps, 30 m, 2.4 GHz
- _802.11g_: 2003, 54 Mbps, 30 m, 2.4 GHz
- _802.11n_ (WiFi 4): 2009, 600 Mbps, 70 m, 2.4/5 GHz
- _802.11ac_ (WiFi 5): 2013, 3.47 Gbps, 70 m, 5 GHz
- _802.11ax_ (WiFi 6): 2020, 14 Gbps, 70 m, 2.4/5 GHz
- _802.11af_: 2014, 35-560 Mbps, 1 km, unused TV bands
- _802.11ah_: 2017, 347 Mbps, 1 km, 900 MHz

All WiFi use CSMA/CA for multiple access, have access point and ad-hoc network versions, and have
a random access mode (DCF: distributed coordinated function) and polling mode (PCF: point coordination
function).

802.11b's 2.4GHz-2.485 GHz spectrum is divided into 14 channels at different frequencies.
The access point admin chooses a channel for the access point.
Interference is possible since the channel chosen can be the same as the neighbouring access point.

Since channels are at 22MHz bandwidth, channels overlap.
Channels 1, 6, and 11 can operate simultaneously with no interference.

At 5GHz, there are 24 non-overlapping channels.

