3B/ECE358/06-Wireless.html
<div id="outline-container-org28f0661" class="outline-3">
<h3 id="org28f0661"><span class="section-number-3">1.1.</span> 802.11</h3>
<div class="outline-text-3" id="text-1-1">
<p>
802.11 Wireless LAN details:
</p>
<ul class="org-ul">
<li><span class="underline">802.11b</span>: 1999, 11 Mbps, 30 m, 2.4 GHz</li>
<li><span class="underline">802.11g</span>: 2003, 54 Mbps, 30 m, 2.4 GHz</li>
<li><span class="underline">802.11n</span> (WiFi 4): 2009, 600 Mbps, 70 m, 2.4/5 GHz</li>
<li><span class="underline">802.11ac</span> (WiFi 5): 2013, 3.47 Gbps, 70 m, 5 GHz</li>
<li><span class="underline">802.11ax</span> (WiFi 6): 2020, 14 Gbps, 70 m, 2.4/5 GHz</li>
<li><span class="underline">802.11af</span>: 2014, 35-560 Mbps, 1 km, unused TV bands</li>
<li><span class="underline">802.11ah</span>: 2017, 347 Mbps, 1 km, 900 MHz</li>
</ul>

<p>
All WiFi use CSMA/CA for multiple access, have access point and ad-hoc network versions, and have
a random access mode (DCF: distributed coordinated function) and polling mode (PCF: point coordination
function).
</p>

<p>
802.11b&rsquo;s 2.4GHz-2.485 GHz spectrum is divided into 14 channels at different frequencies.
The access point admin chooses a channel for the access point.
Interference is possible since the channel chosen can be the same as the neighbouring access point.
</p>

<p>
Since channels are at 22MHz bandwidth, channels overlap.
Channels 1, 6, and 11 can operate simultaneously with no interference.
</p>

<p>
At 5GHz, there are 24 non-overlapping channels.
</p>
</div>
