3B/ECE358/06-Wireless.tex
\subsection{802.11}
\label{sec:orgf62fbd0}

802.11 Wireless LAN details:
\begin{itemize}
\item \uline{802.11b}: 1999, 11 Mbps, 30 m, 2.4 GHz
\item \uline{802.11g}: 2003, 54 Mbps, 30 m, 2.4 GHz
\item \uline{802.11n} (WiFi 4): 2009, 600 Mbps, 70 m, 2.4/5 GHz
\item \uline{802.11ac} (WiFi 5): 2013, 3.47 Gbps, 70 m, 5 GHz
\item \uline{802.11ax} (WiFi 6): 2020, 14 Gbps, 70 m, 2.4/5 GHz
\item \uline{802.11af}: 2014, 35-560 Mbps, 1 km, unused TV bands
\item \uline{802.11ah}: 2017, 347 Mbps, 1 km, 900 MHz
\end{itemize}

All WiFi use CSMA/CA for multiple access, have access point and ad-hoc network versions, and have
a random access mode (DCF: distributed coordinated function) and polling mode (PCF: point coordination
function).

802.11b's 2.4GHz-2.485 GHz spectrum is divided into 14 channels at different frequencies.
The access point admin chooses a channel for the access point.
Interference is possible since the channel chosen can be the same as the neighbouring access point.

Since channels are at 22MHz bandwidth, channels overlap.
Channels 1, 6, and 11 can operate simultaneously with no interference.

At 5GHz, there are 24 non-overlapping channels.
