3B/ECE358/src/06-Wireless.org
*** Architecture
Wireless host communicates with access point.

Basic Service Set (BSS) in infrastructure mode contains wireless hosts and access point.

There is an adhoc mode with no access point, but much less used.

A network administrator allocates a name (SSID) to each access point.

Arriving host must associate with an access point:
1. scans channels, listening for beacon frames containing SSID and access point's MAC address
2. selects access point to associate with
3. may perform authentication
4. typically run DHCP to get IP address in access point's subnet

*Passive Scanning*
1. Beacon frames sent from APs (on different channels)
2. Association Request frame sent: host to selected AP
3. Association Response frame sent: selected AP to host

*Active Scanning*
1. Probe Request frame broadcast from host (on all channels)
2. Probe Response frames sent from APs
3. Association Request frame sent: host to selected AP
4. Association Response frame sent: selected AP to host

Passive scan generally takes more time, uses less energy, and if client does not wait long enough
on a channel, it may miss an AP beacon.

802.11 uses CSMA for multiple access (sense before transmitting, but don't collide with ongoing
transmission by other nodes) and no collision detection since difficult to receive when transmitting
due to weak received signals:
- cannot sense all collisions in any case due to hidden terminal and fading
- _goal_: avoid collisions with two CA mechanisms

For CSMA/CA:
- 802.11 sender:
  1. if sense channel idle for DIFS, then transmit entire frame (no CD)
  2. if sense channel busy, then start random backoff time, timer counts down while channel idle,
     then go to 1 when timer expires
- 802.11 receiver
  1. if frame received OK, return ACK after SIFS<DIFS (ACK needed due to hidden terminal problem and
     bad channel conditions)
  2. if no ACK, after timeout, increase random backoff interval, try again to transmit starting at
     the beginning of the process (max 7 trials)

To avoid collisions when hidden terminals, sender reserves channel use for data frames using
small reservation packets:
- sender first transmits small request-to-send (RTS) packet to AP using CSMA
  - RTSs may still collide with each other (but short)
- AP broadcast clear-to-send CTS (after SIFS) in response to RTS with NAV
- CTS heard by all nodes (since AP can be heard by everyone)
  - sender transmits data frame
  - other stations defer transmissions

This approach avoids data frame collisions completely using small reservations packets.

802.11 frame has:
- _frame control_: 2 bytes
  - protocol version \to 2 bits
  - type \to 2 bits, RTS, CTS, ACK, data
  - subtype \to 4 bits
  - to AP \to 1 bit
  - from AP \to 1 bit
  - more frag \to 1 bit
  - retry \to 1 bit
  - power management \to 1 bit
  - more data AP \to 1 bit
  - WEP \to 1 bit
  - rsvd \to 1 bit
- _duration_: 2 bytes, duration of reserved transmission time (NAV in RTS/CTS)
- _address 1_: 6 bytes, MAC address of wireless host to receive this frame
- _address 2_: 6 bytes, MAC address of wireless host or AP transmitting this frame
- _address 3_: 6 bytes, MAC address of router interface to which AP is attached
- _sequence control_: 2 bytes, frame sequence number for reliable data transfer
- _address 4_: 6 bytes, used only in ad hoc mode
- _payload_: 0 to 2312 bytes, datagram or ARP packet, rarely greater than 1500 bytes
- _CRC_: 4 bytes

Issues with mobility are handover and keeping TCP alive (is learning fast enough).

802.11 also has *power management*:
- _node-to-AP_: AP knows not to transmit frames to this node, so node wakes up before next beacon
  frame (one beacon frame every 100 ms)
- _beacon frame_: contains list of mobiles with AP-to-mobile frames waiting to be sent
  - node will stay awake if AP-to-mobile frames to be sent, otherwise sleep again until next
    beacon frame (wakeup is 250 ms)

*Personal Area Network (PAN)*: less than 10 m diameter (short range), low power, low rate, 2.4 GHz,
up to 2 Mbps
- evolved from Bluetooth specification
- replacement for cables
- ad hoc: no infrastructure, 8 active devices at a time, 255 parked
- master/slaves: a node becomes master
  - master rules, its clock determine time, transmit in odd-numbered slot (625 \mu{}s)
  - slaves only transmit to master on even-numbered slot after being talked to
