3B/ECE358/06-Wireless.html
<div id="outline-container-org0ca7501" class="outline-4">
<h4 id="org0ca7501"><span class="section-number-4">1.1.1.</span> Architecture</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Wireless host communicates with access point.
</p>

<p>
Basic Service Set (BSS) in infrastructure mode contains wireless hosts and access point.
</p>

<p>
There is an adhoc mode with no access point, but much less used.
</p>

<p>
A network administrator allocates a name (SSID) to each access point.
</p>

<p>
Arriving host must associate with an access point:
</p>
<ol class="org-ol">
<li>scans channels, listening for beacon frames containing SSID and access point&rsquo;s MAC address</li>
<li>selects access point to associate with</li>
<li>may perform authentication</li>
<li>typically run DHCP to get IP address in access point&rsquo;s subnet</li>
</ol>

<p>
<b>Passive Scanning</b>
</p>
<ol class="org-ol">
<li>Beacon frames sent from APs (on different channels)</li>
<li>Association Request frame sent: host to selected AP</li>
<li>Association Response frame sent: selected AP to host</li>
</ol>

<p>
<b>Active Scanning</b>
</p>
<ol class="org-ol">
<li>Probe Request frame broadcast from host (on all channels)</li>
<li>Probe Response frames sent from APs</li>
<li>Association Request frame sent: host to selected AP</li>
<li>Association Response frame sent: selected AP to host</li>
</ol>

<p>
Passive scan generally takes more time, uses less energy, and if client does not wait long enough
on a channel, it may miss an AP beacon.
</p>

<p>
802.11 uses CSMA for multiple access (sense before transmitting, but don&rsquo;t collide with ongoing
transmission by other nodes) and no collision detection since difficult to receive when transmitting
due to weak received signals:
</p>
<ul class="org-ul">
<li>cannot sense all collisions in any case due to hidden terminal and fading</li>
<li><span class="underline">goal</span>: avoid collisions with two CA mechanisms</li>
</ul>

<p>
For CSMA/CA:
</p>
<ul class="org-ul">
<li>802.11 sender:
<ol class="org-ol">
<li>if sense channel idle for DIFS, then transmit entire frame (no CD)</li>
<li>if sense channel busy, then start random backoff time, timer counts down while channel idle,
then go to 1 when timer expires</li>
</ol></li>
<li>802.11 receiver
<ol class="org-ol">
<li>if frame received OK, return ACK after SIFS&lt;DIFS (ACK needed due to hidden terminal problem and
bad channel conditions)</li>
<li>if no ACK, after timeout, increase random backoff interval, try again to transmit starting at
the beginning of the process (max 7 trials)</li>
</ol></li>
</ul>

<p>
To avoid collisions when hidden terminals, sender reserves channel use for data frames using
small reservation packets:
</p>
<ul class="org-ul">
<li>sender first transmits small request-to-send (RTS) packet to AP using CSMA
<ul class="org-ul">
<li>RTSs may still collide with each other (but short)</li>
</ul></li>
<li>AP broadcast clear-to-send CTS (after SIFS) in response to RTS with NAV</li>
<li>CTS heard by all nodes (since AP can be heard by everyone)
<ul class="org-ul">
<li>sender transmits data frame</li>
<li>other stations defer transmissions</li>
</ul></li>
</ul>

<p>
This approach avoids data frame collisions completely using small reservations packets.
</p>

<p>
802.11 frame has:
</p>
<ul class="org-ul">
<li><span class="underline">frame control</span>: 2 bytes
<ul class="org-ul">
<li>protocol version &rarr; 2 bits</li>
<li>type &rarr; 2 bits, RTS, CTS, ACK, data</li>
<li>subtype &rarr; 4 bits</li>
<li>to AP &rarr; 1 bit</li>
<li>from AP &rarr; 1 bit</li>
<li>more frag &rarr; 1 bit</li>
<li>retry &rarr; 1 bit</li>
<li>power management &rarr; 1 bit</li>
<li>more data AP &rarr; 1 bit</li>
<li>WEP &rarr; 1 bit</li>
<li>rsvd &rarr; 1 bit</li>
</ul></li>
<li><span class="underline">duration</span>: 2 bytes, duration of reserved transmission time (NAV in RTS/CTS)</li>
<li><span class="underline">address 1</span>: 6 bytes, MAC address of wireless host to receive this frame</li>
<li><span class="underline">address 2</span>: 6 bytes, MAC address of wireless host or AP transmitting this frame</li>
<li><span class="underline">address 3</span>: 6 bytes, MAC address of router interface to which AP is attached</li>
<li><span class="underline">sequence control</span>: 2 bytes, frame sequence number for reliable data transfer</li>
<li><span class="underline">address 4</span>: 6 bytes, used only in ad hoc mode</li>
<li><span class="underline">payload</span>: 0 to 2312 bytes, datagram or ARP packet, rarely greater than 1500 bytes</li>
<li><span class="underline">CRC</span>: 4 bytes</li>
</ul>

<p>
Issues with mobility are handover and keeping TCP alive (is learning fast enough).
</p>

<p>
802.11 also has <b>power management</b>:
</p>
<ul class="org-ul">
<li><span class="underline">node-to-AP</span>: AP knows not to transmit frames to this node, so node wakes up before next beacon
frame (one beacon frame every 100 ms)</li>
<li><span class="underline">beacon frame</span>: contains list of mobiles with AP-to-mobile frames waiting to be sent
<ul class="org-ul">
<li>node will stay awake if AP-to-mobile frames to be sent, otherwise sleep again until next
beacon frame (wakeup is 250 ms)</li>
</ul></li>
</ul>

<p>
<b>Personal Area Network (PAN)</b>: less than 10 m diameter (short range), low power, low rate, 2.4 GHz,
up to 2 Mbps
</p>
<ul class="org-ul">
<li>evolved from Bluetooth specification</li>
<li>replacement for cables</li>
<li>ad hoc: no infrastructure, 8 active devices at a time, 255 parked</li>
<li>master/slaves: a node becomes master
<ul class="org-ul">
<li>master rules, its clock determine time, transmit in odd-numbered slot (625 &mu;s)</li>
<li>slaves only transmit to master on even-numbered slot after being talked to</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-12-05 Thu 15:58</p>
</div>
</body>
</html>
