3B/ECE358/06-Wireless.tex
\subsubsection{Architecture}
\label{sec:org8cc3d4e}
Wireless host communicates with access point.

Basic Service Set (BSS) in infrastructure mode contains wireless hosts and access point.

There is an adhoc mode with no access point, but much less used.

A network administrator allocates a name (SSID) to each access point.

Arriving host must associate with an access point:
\begin{enumerate}
\item scans channels, listening for beacon frames containing SSID and access point's MAC address
\item selects access point to associate with
\item may perform authentication
\item typically run DHCP to get IP address in access point's subnet
\end{enumerate}

\textbf{Passive Scanning}
\begin{enumerate}
\item Beacon frames sent from APs (on different channels)
\item Association Request frame sent: host to selected AP
\item Association Response frame sent: selected AP to host
\end{enumerate}

\textbf{Active Scanning}
\begin{enumerate}
\item Probe Request frame broadcast from host (on all channels)
\item Probe Response frames sent from APs
\item Association Request frame sent: host to selected AP
\item Association Response frame sent: selected AP to host
\end{enumerate}

Passive scan generally takes more time, uses less energy, and if client does not wait long enough
on a channel, it may miss an AP beacon.

802.11 uses CSMA for multiple access (sense before transmitting, but don't collide with ongoing
transmission by other nodes) and no collision detection since difficult to receive when transmitting
due to weak received signals:
\begin{itemize}
\item cannot sense all collisions in any case due to hidden terminal and fading
\item \uline{goal}: avoid collisions with two CA mechanisms
\end{itemize}

For CSMA/CA:
\begin{itemize}
\item 802.11 sender:
\begin{enumerate}
\item if sense channel idle for DIFS, then transmit entire frame (no CD)
\item if sense channel busy, then start random backoff time, timer counts down while channel idle,
then go to 1 when timer expires
\end{enumerate}
\item 802.11 receiver
\begin{enumerate}
\item if frame received OK, return ACK after SIFS<DIFS (ACK needed due to hidden terminal problem and
bad channel conditions)
\item if no ACK, after timeout, increase random backoff interval, try again to transmit starting at
the beginning of the process (max 7 trials)
\end{enumerate}
\end{itemize}

To avoid collisions when hidden terminals, sender reserves channel use for data frames using
small reservation packets:
\begin{itemize}
\item sender first transmits small request-to-send (RTS) packet to AP using CSMA
\begin{itemize}
\item RTSs may still collide with each other (but short)
\end{itemize}
\item AP broadcast clear-to-send CTS (after SIFS) in response to RTS with NAV
\item CTS heard by all nodes (since AP can be heard by everyone)
\begin{itemize}
\item sender transmits data frame
\item other stations defer transmissions
\end{itemize}
\end{itemize}

This approach avoids data frame collisions completely using small reservations packets.

802.11 frame has:
\begin{itemize}
\item \uline{frame control}: 2 bytes
\begin{itemize}
\item protocol version \(\to\) 2 bits
\item type \(\to\) 2 bits, RTS, CTS, ACK, data
\item subtype \(\to\) 4 bits
\item to AP \(\to\) 1 bit
\item from AP \(\to\) 1 bit
\item more frag \(\to\) 1 bit
\item retry \(\to\) 1 bit
\item power management \(\to\) 1 bit
\item more data AP \(\to\) 1 bit
\item WEP \(\to\) 1 bit
\item rsvd \(\to\) 1 bit
\end{itemize}
\item \uline{duration}: 2 bytes, duration of reserved transmission time (NAV in RTS/CTS)
\item \uline{address 1}: 6 bytes, MAC address of wireless host to receive this frame
\item \uline{address 2}: 6 bytes, MAC address of wireless host or AP transmitting this frame
\item \uline{address 3}: 6 bytes, MAC address of router interface to which AP is attached
\item \uline{sequence control}: 2 bytes, frame sequence number for reliable data transfer
\item \uline{address 4}: 6 bytes, used only in ad hoc mode
\item \uline{payload}: 0 to 2312 bytes, datagram or ARP packet, rarely greater than 1500 bytes
\item \uline{CRC}: 4 bytes
\end{itemize}

Issues with mobility are handover and keeping TCP alive (is learning fast enough).

802.11 also has \textbf{power management}:
\begin{itemize}
\item \uline{node-to-AP}: AP knows not to transmit frames to this node, so node wakes up before next beacon
frame (one beacon frame every 100 ms)
\item \uline{beacon frame}: contains list of mobiles with AP-to-mobile frames waiting to be sent
\begin{itemize}
\item node will stay awake if AP-to-mobile frames to be sent, otherwise sleep again until next
beacon frame (wakeup is 250 ms)
\end{itemize}
\end{itemize}

\textbf{Personal Area Network (PAN)}: less than 10 m diameter (short range), low power, low rate, 2.4 GHz,
up to 2 Mbps
\begin{itemize}
\item evolved from Bluetooth specification
\item replacement for cables
\item ad hoc: no infrastructure, 8 active devices at a time, 255 parked
\item master/slaves: a node becomes master
\begin{itemize}
\item master rules, its clock determine time, transmit in odd-numbered slot (625 \(\mu\)s)
\item slaves only transmit to master on even-numbered slot after being talked to
\end{itemize}
\end{itemize}
\end{document}
